MikroElektronika/core_packages/ARM/gcc_clang/def/sam/ATSAMG55G19B/mcu.h
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
typedef struct _DeviceVectors
{
  /* Stack pointer */
  void* pvStack;
  /* Cortex-M handlers */
  void* pfnReset_Handler;                        /* -15 Reset Vector, invoked on Power up and warm reset  */
  void* pfnNonMaskableInt_Handler;               /* -14 Non maskable Interrupt, cannot be stopped or preempted  */
  void* pfnHardFault_Handler;                    /* -13 Hard Fault, all classes of Fault     */
  void* pfnMemoryManagement_Handler;             /* -12 Memory Management, MPU mismatch, including Access Violation and No Match  */
  void* pfnBusFault_Handler;                     /* -11 Bus Fault, Pre-Fetch-, Memory Access Fault, other address/memory related Fault  */
  void* pfnUsageFault_Handler;                   /* -10 Usage Fault, i.e. Undef Instruction, Illegal State Transition  */
  void* pvReservedC9;
  void* pvReservedC8;
  void* pvReservedC7;
  void* pvReservedC6;
  void* pfnSVCall_Handler;                       /*  -5 System Service Call via SVC instruction  */
  void* pfnDebugMonitor_Handler;                 /*  -4 Debug Monitor                        */
  void* pvReservedC3;
  void* pfnPendSV_Handler;                       /*  -2 Pendable request for system service  */
  void* pfnSysTick_Handler;                      /*  -1 System Tick Timer                    */

  /* Peripheral handlers */
  void* pfnSUPC_Handler;                         /* 0   SAMG55G19 Supply Controller (SUPC) */
  void* pfnRSTC_Handler;                         /* 1   SAMG55G19 Reset Controller (RSTC) */
  void* pfnRTC_Handler;                          /* 2   SAMG55G19 Real-time Clock (RTC) */
  void* pfnRTT_Handler;                          /* 3   SAMG55G19 Real-time Timer (RTT) */
  void* pfnWDT_Handler;                          /* 4   SAMG55G19 Watchdog Timer (WDT) */
  void* pfnPMC_Handler;                          /* 5   SAMG55G19 Power Management Controller (PMC) */
  void* pfnEFC_Handler;                          /* 6   SAMG55G19 Embedded Flash Controller (EFC) */
  void* pfnFLEXCOM7_Handler;                     /* 7   SAMG55G19 Flexible Serial Communication (FLEXCOM7) */
  void* pfnFLEXCOM0_Handler;                     /* 8   SAMG55G19 Flexible Serial Communication (FLEXCOM0) */
  void* pfnFLEXCOM1_Handler;                     /* 9   SAMG55G19 Flexible Serial Communication (FLEXCOM1) */
  void* pvReserved10;
  void* pfnPIOA_Handler;                         /* 11  SAMG55G19 Parallel Input/Output Controller (PIOA) */
  void* pfnPIOB_Handler;                         /* 12  SAMG55G19 Parallel Input/Output Controller (PIOB) */
  void* pfnPDMIC0_Handler;                       /* 13  SAMG55G19 Pulse Density Modulation Interface Controller (PDMIC0) */
  void* pfnFLEXCOM2_Handler;                     /* 14  SAMG55G19 Flexible Serial Communication (FLEXCOM2) */
  void* pfnMEM2MEM_Handler;                      /* 15  SAMG55G19 Memory to Memory (MEM2MEM) */
  void* pfnI2SC0_Handler;                        /* 16  SAMG55G19 Inter-IC Sound Controller (I2SC0) */
  void* pfnI2SC1_Handler;                        /* 17  SAMG55G19 Inter-IC Sound Controller (I2SC1) */
  void* pfnPDMIC1_Handler;                       /* 18  SAMG55G19 Pulse Density Modulation Interface Controller (PDMIC1) */
  void* pfnFLEXCOM3_Handler;                     /* 19  SAMG55G19 Flexible Serial Communication (FLEXCOM3) */
  void* pfnFLEXCOM4_Handler;                     /* 20  SAMG55G19 Flexible Serial Communication (FLEXCOM4) */
  void* pfnFLEXCOM5_Handler;                     /* 21  SAMG55G19 Flexible Serial Communication (FLEXCOM5) */
  void* pfnFLEXCOM6_Handler;                     /* 22  SAMG55G19 Flexible Serial Communication (FLEXCOM6) */
  void* pfnTC0_Handler;                          /* 23  SAMG55G19 Timer Counter (TC0)  */
  void* pfnTC1_Handler;                          /* 24  SAMG55G19 Timer Counter (TC0)  */
  void* pfnTC2_Handler;                          /* 25  SAMG55G19 Timer Counter (TC0)  */
  void* pfnTC3_Handler;                          /* 26  SAMG55G19 Timer Counter (TC1)  */
  void* pfnTC4_Handler;                          /* 27  SAMG55G19 Timer Counter (TC1)  */
  void* pfnTC5_Handler;                          /* 28  SAMG55G19 Timer Counter (TC1)  */
  void* pfnADC_Handler;                          /* 29  SAMG55G19 Analog-to-Digital Converter (ADC) */
  void* pvReserved30;
  void* pvReserved31;
  void* pvReserved32;
  void* pvReserved33;
  void* pvReserved34;
  void* pvReserved35;
  void* pvReserved36;
  void* pvReserved37;
  void* pvReserved38;
  void* pvReserved39;
  void* pvReserved40;
  void* pvReserved41;
  void* pvReserved42;
  void* pvReserved43;
  void* pvReserved44;
  void* pvReserved45;
  void* pvReserved46;
  void* pfnUHP_Handler;                          /* 47  SAMG55G19 USB Host Port (UHP)  */
  void* pfnUDP_Handler;                          /* 48  SAMG55G19 USB Device Port (UDP) */
  void* pfnCRCCU_Handler;                        /* 49  SAMG55G19 Cyclic Redundancy Check Calculation Unit (CRCCU) */
} DeviceVectors;
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
#if !defined DONT_USE_PREDEFINED_CORE_HANDLERS

/* CORTEX-M4 core handlers */
void Reset_Handler                 ( void );
void NonMaskableInt_Handler        ( void );
void HardFault_Handler             ( void );
void MemoryManagement_Handler      ( void );
void BusFault_Handler              ( void );
void UsageFault_Handler            ( void );
void SVCall_Handler                ( void );
void DebugMonitor_Handler          ( void );
void PendSV_Handler                ( void );
void SysTick_Handler               ( void );
#endif /* DONT_USE_PREDEFINED_CORE_HANDLERS */

#if !defined DONT_USE_PREDEFINED_PERIPHERALS_HANDLERS

/* Peripherals handlers */
void ADC_Handler                   ( void );
void CRCCU_Handler                 ( void );
void EFC_Handler                   ( void );
void FLEXCOM0_Handler              ( void );
void FLEXCOM1_Handler              ( void );
void FLEXCOM2_Handler              ( void );
void FLEXCOM3_Handler              ( void );
void FLEXCOM4_Handler              ( void );
void FLEXCOM5_Handler              ( void );
void FLEXCOM6_Handler              ( void );
void FLEXCOM7_Handler              ( void );
void I2SC0_Handler                 ( void );
void I2SC1_Handler                 ( void );
void MEM2MEM_Handler               ( void );
void PDMIC0_Handler                ( void );
void PDMIC1_Handler                ( void );
void PIOA_Handler                  ( void );
void PIOB_Handler                  ( void );
void PMC_Handler                   ( void );
void RSTC_Handler                  ( void );
void RTC_Handler                   ( void );
void RTT_Handler                   ( void );
void SUPC_Handler                  ( void );
void TC0_Handler                   ( void );
void TC1_Handler                   ( void );
void TC2_Handler                   ( void );
void TC3_Handler                   ( void );
void TC4_Handler                   ( void );
void TC5_Handler                   ( void );
void UDP_Handler                   ( void );
void UHP_Handler                   ( void );
void WDT_Handler                   ( void );
#endif /* DONT_USE_PREDEFINED_PERIPHERALS_HANDLERS */
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */


